<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BusinessCapitalSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $n = [
            ['business_type_id' => 1,'tax'=>500,'name' =>'মূলধন ১ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 1,'tax'=>1000,'name' =>'মূলধন ১ লাক্ষ হইতে ৫ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 1,'tax'=>1500,'name' =>'মূলধন ৫ লাক্ষ হইতে ১০ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 1,'tax'=>2000,'name' =>'মূলধন ১০ লাক্ষ টাকার ঊর্ধ্বে'],

            ['business_type_id' => 2,'tax'=>400,'name' =>'মূলধন ১ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 2,'tax'=>800,'name' =>'মূলধন ১ লাক্ষ হইতে ৫ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 2,'tax'=>1200,'name' =>'মূলধন ৫ লাক্ষ হইতে ১০ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 2,'tax'=>2000,'name' =>'মূলধন ১০ লাক্ষ টাকার ঊর্ধ্বে'],

            ['business_type_id' => 3,'tax'=>50,'name' =>'মূলধন ১০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 3,'tax'=>100,'name' =>'মূলধন ১০ হাজার হইতে ২৫ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 3,'tax'=>200,'name' =>'মূলধন ২৫ হাজার হইতে ৫০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 3,'tax'=>300,'name' =>'মূলধন ৫০ হাজার টাকার ঊর্ধ্বে'],

            ['business_type_id' => 4,'tax'=>5000,'name' =>'পরিশোধিত মূলধন ৫০ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 4,'tax'=>10000,'name' =>'পরিশোধিত মূলধন ৫০ লাক্ষ হইতে ১ কোটি টাকা পর্যন্ত'],
            ['business_type_id' => 4,'tax'=>25000,'name' =>'পরিশোধিত মূলধন ১ কোটি হইতে ৫ কোটি টাকা পর্যন্ত'],
            ['business_type_id' => 4,'tax'=>40000,'name' =>'পরিশোধিত মূলধন ৫ কোটি টাকার ঊর্ধ্বে'],

            ['business_type_id' => 5,'tax'=>50,'name' =>'মূলধন ৫০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 5,'tax'=>100,'name' =>'মূলধন ৫০ হাজার হইতে ১ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 5,'tax'=>150,'name' =>'মূলধন ১ লাক্ষ হইতে ৩ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 5,'tax'=>2500,'name' =>'মূলধন ৩ লাক্ষ হইতে ১০ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 5,'tax'=>1000,'name' =>'মূলধন ১০ লাক্ষ টাকার ঊর্ধ্বে'],

            ['business_type_id' => 6,'tax'=>100,'name' =>'মূলধন ৫০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 6,'tax'=>200,'name' =>'মূলধন ৫০ হাজার হইতে ১ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 6,'tax'=>250,'name' =>'মূলধন ১ লাক্ষ হইতে ৩ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 6,'tax'=>400,'name' =>'মূলধন ৩ লাক্ষ হইতে ৫ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 6,'tax'=>1000,'name' =>'মূলধন ৫ লাক্ষ টাকার ঊর্ধ্বে'],

            ['business_type_id' => 7,'tax'=>100,'name' =>'মূলধন ৫০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 7,'tax'=>200,'name' =>'মূলধন ৫০ হাজার হইতে ১ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 7,'tax'=>250,'name' =>'মূলধন ১ লাক্ষ হইতে ৩ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 7,'tax'=>400,'name' =>'মূলধন ৩ লাক্ষ হইতে ৫ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 7,'tax'=>1000,'name' =>'মূলধন ৫ লাক্ষ টাকার ঊর্ধ্বে'],

            ['business_type_id' => 8,'tax'=>5000,'name' =>'মূলধন বা পরিশোধিত মূলধন ২০ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 8,'tax'=>15000,'name' =>'মূলধন বা পরিশোধিত মূলধন ২০ লাক্ষ হইতে ৪০ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 8,'tax'=>50000,'name' =>'মূলধন বা পরিশোধিত মূলধন ৪০ লাক্ষ টাকার ঊর্ধ্বে'],

            ['business_type_id' => 9,'tax'=>300,'name' =>'সাধারণ'],
            ['business_type_id' => 9,'tax'=>500,'name' =>'শীতাতপ নিয়ন্ত্রিত'],

            ['business_type_id' => 10,'tax'=>100,'name' =>'সাধারণ'],
            ['business_type_id' => 10,'tax'=>250,'name' =>'শীতাতপ নিয়ন্ত্রিত'],

            ['business_type_id' => 11,'tax'=>50,'name' =>'সাধারণ'],
            ['business_type_id' => 11,'tax'=>250,'name' =>'অটোমেটিক মেশিনযুক্ত লন্ড্রী'],
            ['business_type_id' => 11,'tax'=>200,'name' =>'লন্ড্রী শোরুম'],

            ['business_type_id' => 12,'tax'=>500,'name' =>'ব্যাংক, আর্থিক প্রতিষ্ঠান, বেসরকারি অফিস, প্রতিষ্ঠান বা সংস্থা বাঁ উহাদের কোন শাখা'],

            ['business_type_id' => 13,'tax'=>1000,'name' =>'তৃতীয় শ্রেনীর ঠিকাদারী প্রতিষ্ঠান'],
            ['business_type_id' => 13,'tax'=>2000,'name' =>'দ্বিতীয় শ্রেনীর ঠিকাদারী প্রতিষ্ঠান'],
            ['business_type_id' => 13,'tax'=>5000,'name' =>'প্রথম শ্রেনীর ঠিকাদারী প্রতিষ্ঠান'],

            ['business_type_id' => 14,'tax'=>500,'name' =>'কৃষি পন্যের আড়ত'],

            ['business_type_id' => 15,'tax'=>5000,'name' =>'যে কোন ধরণের ইঞ্জিনিয়ারিং ফার্ম'],
            ['business_type_id' => 15,'tax'=>5000,'name' =>'কনসালটেন্সি ফার্ম'],
            ['business_type_id' => 15,'tax'=>5000,'name' =>'সলিসিটর ফার্ম'],

            ['business_type_id' => 16,'tax'=>250,'name' =>'আয়করযোগ্য আয় না হইবার ক্ষেত্রে'],
            ['business_type_id' => 16,'tax'=>500,'name' =>'আয়করযোগ্য আয় হইবার ক্ষেত্রে'],


            ['business_type_id' => 17,'tax'=>100,'name' =>'মূলধন ৫০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 17,'tax'=>200,'name' =>'মূলধন ৫০ হাজার হইতে ১ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 17,'tax'=>250,'name' =>'মূলধন ১ লাক্ষ হইতে ৩ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 17,'tax'=>400,'name' =>'মূলধন ৩ লাক্ষ হইতে ৫ লাক্ষ টাকা পর্যন্ত'],
            ['business_type_id' => 17,'tax'=>2500,'name' =>'মূলধন ৫ লাক্ষ টাকার ঊর্ধ্বে'],

            ['business_type_id' => 18,'tax'=>50,'name' =>'মূলধন ১০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 18,'tax'=>100,'name' =>'মূলধন ১০ হাজার হইতে ২০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 18,'tax'=>150,'name' =>'মূলধন ২০ হাজার হইতে ৫০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 18,'tax'=>200,'name' =>'মূলধন ৫০ হাজার টাকার ঊর্ধ্বে'],

            ['business_type_id' => 19,'tax'=>1000,'name' =>'মূলধন নির্বিশেষে যে কোন পাইকারী দোকান'],
            ['business_type_id' => 19,'tax'=>50,'name' =>'মূলধন ১০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 19,'tax'=>100,'name' =>'মূলধনের পরিমান ১০ হাজার হইতে ৫০ হাজার টাকা পর্যন্ত'],
            ['business_type_id' => 19,'tax'=>150,'name' =>'মূলধনের পরিমান ৫০ হাজার টাকার ঊর্ধ্বে'],

            ['business_type_id' => 20,'tax'=>20,'name' =>'রিক্সার মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>200,'name' =>'তিন চাকা বা দুই চাকা বিশিষ্ঠ যান্ত্রিক যানবাহনের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>150,'name' =>'টেম্পোর মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>250,'name' =>'বাস, মিনিবাসের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>250,'name' =>'ট্রাক/কার্গোভ্যান (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>300,'name' =>'পরিবহন এজেন্সী বা পরিবহন ঠিকাদার (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>100,'name' =>'যাত্রী পরিবহনের যান্ত্রিক নৌযানের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>150,'name' =>'মালামাল পরিবহনের যান্ত্রিক নৌযানের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>200,'name' =>'যাত্রী পরিবহনকারী লঞ্চ, স্টীমার (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>250,'name' =>'মালামাল পরিবহনকারী কার্গো (প্রতিটির জন্য)'],
            ['business_type_id' => 20,'tax'=>200,'name' =>'কার বা মাইক্রোবাসের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],

            ['business_type_id' => 21,'tax'=>10,'name' =>'রিক্সার মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 21,'tax'=>50,'name' =>'তিন চাকা বা দুই চাকা বিশিষ্ঠ যান্ত্রিক যানবাহনের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 21,'tax'=>75,'name' =>'টেম্পোর মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 21,'tax'=>125,'name' =>'বাস, মিনিবাসের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 21,'tax'=>125,'name' =>'ট্রাক/কার্গোভ্যান (প্রতিটির জন্য)'],
            ['business_type_id' => 21,'tax'=>50,'name' =>'যান্ত্রিক নৌযানের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],
            ['business_type_id' => 21,'tax'=>100,'name' =>'লঞ্চ, স্টীমার (প্রতিটির জন্য)'],
            ['business_type_id' => 21,'tax'=>100,'name' =>'কার বা মাইক্রোবাসের মালিক/প্রতিষ্ঠান (প্রতিটির জন্য)'],

            ['business_type_id' => 22,'tax'=>10,'name' =>'প্রতি বর্গফুট বা উহার অংশ বিশেষের জন্য'],
            ['business_type_id' => 22,'tax'=>20,'name' =>' আলোক সজ্জিত বিজ্ঞাপন (যথাঃ নিউন সাইন, প্লাস্টিক সাইন ইত্যাদি)'],

            ['business_type_id' => 23,'tax'=>50,'name' =>'১০ হাজার প্রর্যন্ত'],
            ['business_type_id' => 23,'tax'=>100,'name' =>'১০ হাজার হইতে ২৫ হাজার প্রর্যন্ত'],
            ['business_type_id' => 23,'tax'=>200,'name' =>'২৫ হাজার হইতে ৫০ হাজার প্রর্যন্ত'],
            ['business_type_id' => 23,'tax'=>300,'name' =>'৫০ হাজার হইতে ১ লাক্ষ প্রর্যন্ত'],
            ['business_type_id' => 23,'tax'=>500,'name' =>'১ লাক্ষ হইতে ক২ লাক্ষ প্রর্যন্ত'],

            ['business_type_id' => 24,'tax'=>50,'name' =>'১০ হাজার প্রর্যন্ত'],
            ['business_type_id' => 24,'tax'=>100,'name' =>'১০ হাজার হইতে ২৫ হাজার প্রর্যন্ত'],
            ['business_type_id' => 24,'tax'=>200,'name' =>'২৫ হাজার হইতে ৫০ হাজার প্রর্যন্ত'],
            ['business_type_id' => 24,'tax'=>300,'name' =>'৫০ হাজার হইতে ১ লাক্ষ প্রর্যন্ত'],
            ['business_type_id' => 24,'tax'=>500,'name' =>'১ লাক্ষ হইতে ক২ লাক্ষ প্রর্যন্ত'],

        ];
        DB::table('business_capitals')->insert($n);
    }
}
