<?php

namespace Database\Seeders;

use App\Models\BusinessCapital;
use App\Models\BusinessType;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;

class BusinessTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Schema::disableForeignKeyConstraints();
        // BusinessType::truncate();
        // Schema::enableForeignKeyConstraints();
        // BusinessType::factory()->has(BusinessCapital::factory()->count(3))->count(10)->create();
        $n=[
          ['name' => 'গুদাম (লিমিটেড কোম্পানী ব্যতীত)'],
          ['name' => 'দিমাগার (লিমিটেড কোম্পানী ব্যতীত)'],
          ['name' => 'ক্ষুদ্র ও কুটির শিল্প (লিমিটেড কোম্পানী ব্যতীত)'],
          ['name' => 'শিল্প কারখানা (লিমিটেড কোম্পানী ব্যতীত)'],
          ['name' => 'কৃষি খামার, দুগ্ধ খামার, হাঁস-মুরগির খামার, মৎস্য খামার, গবাদি পশুর খামার ইত্যাদি (লিমিটেড কোম্পানী ব্যতীত)'],
          ['name' => 'ধান ভাঙ্গানো কল, আটা বা ময়দার কল বা মিল, তেলের কল (লিমিটেড কোম্পানী ব্যতীত)'],
          ['name' => "স'মিল, বিদ্যুৎ চালিত অন্যান্য মিল (লিমিটেড কোম্পানী ব্যতীত)"],
          ['name' => 'ইট ভাটা বাঁ অন্যান্য সিরামিক প্রস্তুতকারক'],
          ['name' => 'সিনেমা হল'],
          ['name' => 'বিউটি পারলার, হেয়ার ড্রেসিং সেলুন'],//10
          ['name' => 'লন্ড্রী'],
          ['name' => 'ব্যাংক, আর্থিক প্রতিষ্ঠান, বেসরকারি অফিস, প্রতিষ্ঠান বা সংস্থা বাঁ উহাদের কোন শাখা'],
          ['name' => 'ঠিকাদারী ফার্ম বাঁ প্রতিষ্ঠান'],
          ['name' => 'কৃষি পণ্যের আড়ত'],
          ['name' => 'পেশা, র্বত্তি (কলিং)'],
          ['name' => 'আত্মকর্মে নিয়জিত চিকিৎসক, প্রকৌশলী, আইনজীবী, আইটি ফার্ম, ফ্রিল্যান্সিং ইত্যাদি'],
          ['name' => 'আবাসিক হোটেল বা মোটেল'],
          ['name' => 'রেস্তোরা, খাবার দোকান, মিষ্টির দোকান'],
          ['name' => 'দোকানদার বা ব্যবসায়ী (খোলা জায়গায় যে সকল হকার্সগণ কেনাবেচা করেন, তাহারা ইহার অন্তর্ভক্ত হইবেন না)'],
          ['name' => 'ভাড়ায় চালিত যানবাহন'],//20
          ['name' => 'ভাড়ায় চালিত নয় এইরুপ যানবাহন'],
          ['name' => 'বিজ্ঞাপনের ওপর করে'],
          //বিবিধ er under a
          ['name' => 'দিলারশীপ/পরিবেশন/সরবরাহকারী'],
          ['name' => 'ঘটক/ম্যারেজ মিডিয়া সেন্টার'],
          ['name' => 'ফেরিভাবে বিক্রেতা'],
          ['name' => 'ভেজস চিকিৎসা/ফার্মেসী'],
          ['name' => 'Food Processign/বেকারী আইটেম'],
          ['name' => 'সার ও বালাইনাশক বিক্রেতা'],
          ['name' => 'জুয়েলার্স'],
          ['name' => 'সিমেন্টস সামগ্রী'],//30
          ['name' => 'লারব্রারী'],
          ['name' => 'ডিসলাইন/ইন্টারনেট'],
          ['name' => 'ফ্লাক্সিং/বিকাশ-এজেন্ট'],
          ['name' => 'মুদিখানা/ভ্যারাইটি স্টোর'],//34
        ];
        DB::table('business_types')->insert($n);
    }
}
